Reports/_ПланФактПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Report>
		<Properties>
			<Name>_ПланФактПроекта</Name>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/БюджетПоМесяцам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>БюджетПоМесяцам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>РКО</Name>
					<Comment>Факт облагается РКО</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлана</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПланаБюджета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗадачаПроекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиПроектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяСметы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиСметы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипСуммыБюджета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипСуммыБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипСуммыБюджета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>План</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПервичныйДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЗадачиПроектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ЗадачиПроектов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Проекты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроектМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостановкаЗадачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоИсполнители</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТиповаяЗадача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТиповыеЗадачиПроектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоРабот</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеРабот</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланироватьОтКонца</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбеспеченоПрошлымиПериодами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодЗадачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановоеЮЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникФинансирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадачПроектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Исполнители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяСтавка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТарифныеСтавки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Загрузка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭтапыГрафикаОплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Фиксировано</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Гарантировано</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭтапыГрафикаРеализации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаРеализации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРеализации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентРеализации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Фиксировано</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Гарантировано</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПлана</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыПланаБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплата</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭтапыГрафикаРеализацииПоДоговорам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаРеализации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРеализации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентРеализации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтрольныеТочки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/_ПланФактПроекта/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ОтмеченныеЗадачиПроекта( ЗадачиПроекта )
	Стр = "";
	Для Каждого Эл ИЗ ЗадачиПроекта Цикл
		Если Эл.Пометка Тогда
			Стр = Стр + ?(ЗначениеЗаполнено(Стр), ", ", "") + Эл.Значение;
		КонецЕсли;
	КонецЦикла;
	Возврат Стр;
КонецФункции

&НаСервереБезКонтекста
Функция СуммаЗаТекущийМесяц( ТЗ, Статья, Месяц, ВариантОтчета, ФактВключаяМесяц)
	Отбор = Новый Структура;
	Отбор.Вставить("Статья", Статья);
	Отбор.Вставить("Месяц", Месяц );
	Строки = ТЗ.НайтиСтроки( Отбор );
	Если Строки.Количество() > 0 Тогда
		Если ВыводимСуммуПлана( Месяц, ВариантОтчета, ФактВключаяМесяц ) Тогда
			Возврат Строки[0].СуммаПлан;
		Иначе
			Возврат Строки[0].СуммаФакт;
		КонецЕсли;
		
		//Возврат Строки[0].СуммаЗаМесяц;
	КонецЕсли;
	Возврат 0; 
КонецФункции

&НаСервереБезКонтекста
Функция ВыводимСуммуПлана( Месяц,  ВариантОтчета, ФактВключаяМесяц )
	Если 		ВариантОтчета = 1 Тогда
		Возврат Истина;
	ИначеЕсли 	ВариантОтчета = 2 Тогда
		Возврат Ложь;
	Иначе
		Если Месяц <= ФактВключаяМесяц Тогда
			Возврат ВыводимСуммуПлана( Месяц, 2, ФактВключаяМесяц );
		Иначе
			Возврат ВыводимСуммуПлана( Месяц, 1, ФактВключаяМесяц );
		КонецЕсли;		
		
	КонецЕсли;
КонецФункции

&НаСервере
Процедура Сформировать_НаСервере( ТабДок )
	// 
    Макет 	= РеквизитФормыВЗначение("Отчет").ПолучитьМакет("ПланПроекта"); 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БюджетПоМесяцамОбороты.СтатьяСметы КАК Статья,
		|	СУММА(БюджетПоМесяцамОбороты.СуммаОборот) КАК СуммаЗаМесяц,
		|	БюджетПоМесяцамОбороты.Месяц,
		|	СУММА(ВЫБОР
		|			КОГДА БюджетПоМесяцамОбороты.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипСуммыБюджета.Факт)
		|				ТОГДА БюджетПоМесяцамОбороты.СуммаОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаФакт,
		|	СУММА(ВЫБОР
		|			КОГДА БюджетПоМесяцамОбороты.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипСуммыБюджета.План)
		|				ТОГДА БюджетПоМесяцамОбороты.СуммаОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаПлан,
		|	ВЫБОР
		|		КОГДА БюджетПоМесяцамОбороты.Месяц <= &МесяцФакт
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтотМесяцФакт
		|ИЗ
		|	РегистрНакопления.БюджетПоМесяцам.Обороты(, , , ЗадачаПроекта В (&Задачи)) КАК БюджетПоМесяцамОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	БюджетПоМесяцамОбороты.Месяц,
		|	БюджетПоМесяцамОбороты.СтатьяСметы";

		
	// с пометками
	мЗадач = Новый Массив;
	Для Каждого Эл ИЗ ЗадачиПроекта Цикл
		Если Эл.Пометка Тогда
			мЗадач.Добавить( Эл.Значение );
		КонецЕсли;
	КонецЦикла;
		
	Запрос.УстановитьПараметр("Задачи", 	мЗадач );
	Запрос.УстановитьПараметр("МесяцФакт", 	ФактВключаяМесяц );
	// рещультат
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() <> 0 Тогда
		Результат.Сортировать("Месяц");
		ПервыйМесяц 	= Результат[0].Месяц;
		ПоследнийМесяц 	= Результат[Результат.Количество()-1].Месяц;
	Иначе
		Возврат;
	КонецЕсли;
	
	ОблШ = Макет.ПолучитьОбласть("Шапка|Начало");
	ОблШ.Параметры.ВидОтчета		= ?(ВариантОтчета=1, "План",
									  ?(ВариантОтчета=2, "Факт", "Факт, включая " + Формат( ФактВключаяМесяц, "ДФ='ММММ гггг'") + ", далее план"
									  ));
									  
	ОблШ.Параметры.Проект 			= Проект;
	ОблШ.Параметры.ЗадачиПроекта 	= ОтмеченныеЗадачиПроекта( ЗадачиПроекта );
	ТабДок.Вывести(ОблШ);
	
	ТекущийМесяц = ПервыйМесяц;
	Пока ТекущийМесяц <= ПоследнийМесяц Цикл
		ОблШД = Макет.ПолучитьОбласть("Шапка|ЗаМесяц");
		ОблШД.Параметры.Месяц 		= Формат( ТекущийМесяц, "ДФ = 'ММММ гггг'");
		ОблШД.Параметры.ТипСуммы 	= ?( ВыводимСуммуПлана( ТекущийМесяц, ВариантОтчета, ФактВключаяМесяц),  "план", "Факт");
		
		ТабДок.Присоединить( ОблШД );
		ТекущийМесяц = ДобавитьМесяц( ТекущийМесяц, 1);
		
	КонецЦикла;
	//
	//  готовим данные для отчета
	сМесяцы = Новый Соответствие;
	сВсего	= Новый Соответствие;
	
	// 2014
	СтруктураСметы 	= УП_СметаПроекта.ПолучитьСтруктуруСметыЗадачи( Проект.ГодПроекта );	
	
	ТекущийМесяц = ПервыйМесяц;
	Пока ТекущийМесяц <= ПоследнийМесяц Цикл
		сБюджетМесяца = Новый Соответствие;
		
		Для Каждого СтрСС ИЗ СтруктураСметы Цикл
			ИмяСтатьи 		= СтрСС.Ключ;
			Статья			= СтрСс.Значение.Статья;//.Статья;
			СуммаЗаМесяц	= СуммаЗаТекущийМесяц( Результат, Статья, ТекущийМесяц, ВариантОтчета, ФактВключаяМесяц );
			сБюджетМесяца.Вставить( ИмяСтатьи, СуммаЗаМесяц);
			
			// итого
			СуммаВсего = сВсего.Получить( ИмяСтатьи );
			сВсего.Вставить( ИмяСтатьи, СуммаЗаМесяц + ?(СуммаВсего=Неопределено,0,СуммаВсего));
			
		КонецЦикла;
		// пересчитываем итоговые статьи
		УП_СметаПроекта.ПересчетСметыЗадачи( СтруктураСметы, сБюджетМесяца );
		//
		сМесяцы.Вставить( ТекущийМесяц, сБюджетМесяца ); 
		//
		ТекущийМесяц = ДобавитьМесяц( ТекущийМесяц, 1);
	КонецЦикла;
	// пересчитываем итоговые статьи
	УП_СметаПроекта.ПересчетСметыЗадачи( СтруктураСметы, сВсего );
	
	 //!!!
	 //выводим отчет	
	 Для Каждого СтрСС ИЗ СтруктураСметы Цикл
		ИмяСтатьи 	= СтрСС.Ключ;
		ГорОбласть 	= ?(СтрСС.Значение.Итоговая, "СтатьяИт", "Статья" );
		
		ОблСтатья 						= Макет.ПолучитьОбласть(ГорОбласть + "|Начало");
		ОблСтатья.Параметры.КодСтатьи 	= СтрСС.Значение.КодСтатьи;
		ОблСтатья.Параметры.Статья 		= СтрСС.Значение.Статья; //???
		ОблСтатья.Параметры.Сумма 		= сВсего[ИмяСтатьи];
		ТабДок.Вывести(ОблСтатья);
		
		// по месяцам			
		ТекущийМесяц = ПервыйМесяц;
		Пока ТекущийМесяц <= ПоследнийМесяц Цикл
			ОблСтатьяД = Макет.ПолучитьОбласть( ГорОбласть + "|ЗаМесяц");
			ОблСтатьяД.Параметры.СуммаЗаМесяц = сМесяцы[ТекущийМесяц][ИмяСтатьи];
			ТабДок.Присоединить( ОблСтатьяД );
			ТекущийМесяц = ДобавитьМесяц( ТекущийМесяц, 1);
			
		КонецЦикла;
	КонецЦикла;
	
	
	//Если Проект.ГодПроекта < 2014 Тогда
	
		// выводим прибывль по проекту нарастающим итогом
		ГорОбласть						= "СтатьяИт";
		ОблСтатья 						= Макет.ПолучитьОбласть(ГорОбласть + "|Начало");
		
		
		Если Проект.ГодПроекта < 2014 Тогда
			ОблСтатья.Параметры.Статья 		= "Прибыль по проекту (нарастающим итогом)";
			ИмяСтатьи 						= "ПрибыльПоПроекту";
		Иначе
			ОблСтатья.Параметры.Статья 		= "Валовый доход по проекту (нарастающим итогом)";
			ИмяСтатьи 						= "ВаловыйДоход";
		КонецЕсли;
		//
		ОблСтатья.Параметры.Сумма 		= сВсего[ИмяСтатьи];
		ТабДок.Вывести(ОблСтатья);
		// по месяцам			
		ТекущийМесяц 			= ПервыйМесяц;
		СуммаНарастающимИтогом 	= 0;
		Пока ТекущийМесяц <= ПоследнийМесяц Цикл
			ОблСтатьяД 							= Макет.ПолучитьОбласть( ГорОбласть + "|ЗаМесяц");
			СуммаНарастающимИтогом				= СуммаНарастающимИтогом + сМесяцы[ТекущийМесяц][ИмяСтатьи];
			ОблСтатьяД.Параметры.СуммаЗаМесяц 	= СуммаНарастающимИтогом;
			ТабДок.Присоединить( ОблСтатьяД );
			ТекущийМесяц = ДобавитьМесяц( ТекущийМесяц, 1);
		КонецЦикла;
	//КонецЕсли;	
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗадачиПроекта()
	ЗадачиПроекта.Очистить();
	ВыбСпр = Справочники.ЗадачиПроектов.Выбрать( , Проект );
	Пока ВыбСпр.Следующий() Цикл
		ЗадачиПроекта.Добавить( ВыбСпр.Ссылка,, Истина );
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если НЕ ЗначениеЗаполнено( ВариантОтчета ) Тогда
		Предупреждение("Укажите вариант отчета!",  10);
		Возврат;
	КонецЕсли;
	
	ТабДок = Новый ТабличныйДокумент;
	//
	Сформировать_НаСервере( ТабДок );
	
	//
	ТабДок.АвтоМасштаб			= Истина;
	ТабДок.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабДок.ТолькоПросмотр		= Истина;
	ТабДок.Показать();
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	ЗаполнитьЗадачиПроекта();
КонецПроцедуры


&НаКлиенте
Процедура УстановитьФлажки(Команда)
	ЗадачиПроекта.ЗаполнитьПометки( Истина );
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	ЗадачиПроекта.ЗаполнитьПометки( Ложь );
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ФактВключаяМесяцПриИзменении(Элемент)
	ФактВключаяМесяц = НачалоМесяца( ФактВключаяМесяц );
КонецПроцедуры
